fibeep/esp-32-vend-working/vending-esp32/sdkconfig.defaults
# ------------------------------------------------------------------
# sdkconfig.defaults - Default SDK configuration for vending-esp32
# ------------------------------------------------------------------
# These values are applied when building without an existing sdkconfig.
# Run `idf.py menuconfig` to customize further.
# ------------------------------------------------------------------

# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# Partition table: two OTA (large) for future OTA updates
CONFIG_PARTITION_TABLE_TWO_OTA_LARGE=y

# Bluetooth: NimBLE stack (lightweight BLE-only stack)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# NimBLE roles (all needed for GATT server + PAX scanning)
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_GATT_CLIENT=y
CONFIG_BT_NIMBLE_GATT_SERVER=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y

# NimBLE connection and buffer settings
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
CONFIG_BT_NIMBLE_EXT_SCAN=y
CONFIG_BT_NIMBLE_ENABLE_PERIODIC_SYNC=y

# BLE scanning support (for PAX counter)
CONFIG_BT_CTRL_BLE_SCAN=y
CONFIG_BT_CTRL_BLE_MASTER=y
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_SUPP=y
CONFIG_BT_CTRL_BLE_SCAN_DUPL=y
CONFIG_BT_CTRL_SCAN_DUPL_TYPE_DEVICE=y

# BLE TX power
CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P9=y

# MQTT
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET_SECURE=y

# MDB Cashless Device defaults
CONFIG_CASHLESS_ADDR_1=y
CONFIG_CASHLESS_DEVICE_ADDRESS=16
CONFIG_MDB_SCALE_FACTOR=1
CONFIG_MDB_DECIMAL_PLACES=2

# MQTT Broker defaults
CONFIG_MQTT_BROKER_URI="mqtt://mqtt.panamavendingmachines.com"
CONFIG_MQTT_USERNAME="vmflow"
CONFIG_MQTT_PASSWORD="vmflow"
